NikolayBobovnikov/ircapture/auvir_embed/mocap/transmitter/stm32f103/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <stdbool.h>
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_rx;
DMA_HandleTypeDef hdma_spi1_tx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
//PWM timer configuration
TIM_HandleTypeDef * phtim_envelop = &htim1;
const uint16_t pwm_timer_prescaler = 0;
const uint16_t pwm_timer_period = 949;
const uint16_t pwm_pulse_width = 475;

///TODO: refactor constants below
bool received_ir_signal = false;

const    uint8_t tx_data = 0b11111111;
#define  TOTAL_BITS 8
const    uint8_t tx_total_bits = TOTAL_BITS;
volatile uint8_t tx_current_bit_position = 0;
volatile uint8_t tx_bit = 0;

         uint8_t rx_data = 0;
         uint8_t rx_total_bits = TOTAL_BITS;
volatile uint8_t rx_current_bit_position = 0;
volatile uint8_t rx_bit = 0;


uint8_t level[100] = {0};
uint8_t level_ind = 0;

uint16_t pwm[100] = {0};
uint8_t ind = 0;
uint16_t ccr1_tn_1;
uint16_t ccr1_tn;
uint16_t ccr1;
uint16_t ccr2;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

//TODO: specify timer constants
// values below are numbers of timer ticks
const uint16_t PeriodOfStartStopBits = 1000;
const uint16_t PeriodOfDataBits = 2000;
const uint16_t PeriodBetweenDataFrames = 5000;
const uint16_t HalfPeriodOfStartStopBits = 500;
const uint16_t HalfPeriodOfDataBits = 1000;

enum ReceiverStates
{
    RX_WAITING_FOR_START_BIT,
    RX_START_BIT_SENDING,
    RX_START_BIT_SENT,
    RX_DATA_RECEIVING,
    RX_DATA_RECEIVED,
    RX_STOP_BIT_RECEIVING,
    RX_STOP_BIT_RECEIVED
};
volatile uint8_t ReceiverState = RX_WAITING_FOR_START_BIT;

enum TransmitterStates
{
    TX_WAITING_FOR_TRANSMISSION,
    TX_SENDING_START_BIT,
    TX_SENDING_DATA,
    TX_SENDING_STOP_BIT,
    TX_DELAY
};
volatile uint8_t TransmitterState = TX_WAITING_FOR_TRANSMISSION;

enum StartStopSequenceStates
{
    STAGE_0,
    STAGE_ON1,
    STAGE_OFF,
    STAGE_ON2
};
volatile uint8_t StartStopSequenceTransmitState = STAGE_0;
volatile uint8_t StartStopSequenceReceiveState = STAGE_0;

/*
  TIM2_CH1 PA0
  TIM2_CH2 PA1
  TIM2_CH3 PA2
  TIM2_CH4 PA3
  TIM3_CH1 PA6
  TIM3_CH2 PA7
  TIM3_CH3 PB0
  TIM3_CH4 PB1
  TIM4_CH1 PB6
  TIM4_CH2 PB7
  TIM4_CH3 PB8
  TIM4_CH4 PB9
*/


enum OutputChannelsStates
{
    Timer2Channel1, // 1  PA0 v
    Timer2Channel2, // 2  PA1
    Timer2Channel3, // 3  PA2 v
    Timer2Channel4, // 4  PA3
    Timer3Channel1, // 5  PA6 v
    Timer3Channel2, // 6  PA7 v
    Timer3Channel3, // 7  PB0
    Timer3Channel4, // 8  PB1 v
    Timer4Channel1, // 9  PB6
    Timer4Channel2, // 10 PB7
    Timer4Channel3, // 11 PB8 - reserved
    Timer4Channel4  // 12 PB9 - without mask
};
//LED on primary output channel works without mask, so used for sending
//start/stop sequence, beamer ID, time
const uint8_t primary_output_channel = Timer4Channel4;
uint8_t currentOutputTimChannel = Timer4Channel4;
uint8_t input_channel_per_message_bit[TOTAL_BITS] =    {Timer2Channel1, // 1
                                                        Timer2Channel2, // 2
                                                        Timer2Channel3, // 3
                                                        Timer2Channel4, // 4
                                                        Timer3Channel1, // 5
                                                        Timer3Channel2, // 6
                                                        Timer3Channel3, // 7
                                                        Timer3Channel4  // 8
                                                       };


// level 1
void send_data();

// level 2
void transmit_handler();

// level 3

// level 4
void force_envelop_timer_output_on();
void force_envelop_timer_output_off();

inline void nop();

